const getUser = info => {
	const { id, is_bot: isBot, first_name: firstName, last_name: lastName } = info
	const name = (firstName ? firstName : '' + ' ' + lastName ? lastName : '').trim()
	return { id, isBot, name }
}
const inlineKeyboard = (buttons) => {
	return { reply_markup: {
	   inline_keyboard: buttons
   }}
}
const columns = (buttons) => {
   return { reply_markup: {
	   inline_keyboard: buttons.map(el =>[el])
   }}
}

const pin = `هذه اللستة رح تكون لستة الPins الدائمة لاهم المواضيع المنشورة بالقناة ورح نظل نحدثها، شفنا هذا الشيء افضل لتنظيم القناة وتسهيل الامر على الي ديبحثون على شيء معين:
- The Post: https://t.me/thepostiq
- The Post Office: https://t.me/thepostofficeiq; Art Club: https://t.me/artclub_iq
- Instagram; Art Club Instagram
- LinkedIn
- Facebook
- Twitter
الكورسات وتطوير المهارات:
- كورسات عامة
- تطوير الانكليزي وكورساته
- كورسات تقنية
-اهم المهارات والمواضيع الي ممكن تبدع بيها بوقتنا الحالي

الفرص:
- اهم لستة بكل القناة، عبارة عن كل معارفي من الصفحات والقنوات والكروبات الي ممكن تتابعوها لفرص وعلاقات اكثر
- الفرص التطوعية عراقيا والكترونيا

البرامج:
- الMEPI، هذا رابع واحد بس الاسم معكوس Tomorrow's Leaders؟
- الايلب، هههه ميحتاج احجي شيء بعد. (المقدمة/التقديم/البرنامج)
- زين الTED شنو لخاطر الله، هذا مو مؤتمر؟
- بربك، شني هاي الLOT، تنوجل؟
- خبصونا بالDEP، شنو هذا متكلي؟
- الSYE وما ادراك ما الSYE؟

موارد عامة:
- موارد لدراسة الTOEFL
- الكتيب الكامل لتهكير الSAT (الاختبار/الارسال)
- الوافي في الUSMLE

اسئلة شائعة
- شنو هي الستارت اب؟
- شنو هي ال Data Science؟
- شلون اطور الانكلش مالتي؟
الدراسة بالعراق:
- النظم الدراسية بالعراق
- شنوة التعليم الموازي بالعراق
- الجامعة الامريكية ببغداد 

لستة بالجامعات الامريكية الاكثر رغبة ومنحها المتوفرة

الدراسة برة:
- متطلبات القبول الجامعي باكثر الدول المرغوبة خارج العراق 
- نصائح كلش مهمة للتقديم برة ومثال على خطة دراسية بالخارج
- شرح عن ال Community Colleges بامريكا الشمالية
- طرق تحصيل الفلوس لدفع اجور الدراسة برة 
- شرح عن الكشف البنكي Bank Statement
- شتحتاج علمود تقدم على المنح بامريكا وكندا
- شرح عن ال Common App Essay للتقديم على امريكا
- لستة بالجامعات الامريكية الي تقدم درجات الكترونية
- متطلبات الدراسة بالمانيا
- متطلبات الدراسة بتركيا
- شرح عن الPersonal Statement للتقديم على بريطانيا 

نصايح اخوية:
- اهمية الLinkedIn
- اهمية شكل الEmail مالتك
- اهمية الGitHub المصدرية للكل وللتقنيين والابداعيين خاصة
- اهمية السيرة الذاتية CV
- الشغل كFreelancer

الاختصارات الاصطلاحية:
- المجتمعية
- الدراسية
- العملية 
- التقنية 
- الطبية

المصادر
`



export { inlineKeyboard, columns, getUser, pin}